CREATE DATABASE  IF NOT EXISTS `mydb` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `mydb`;
-- MySQL dump 10.13  Distrib 5.6.13, for Win32 (x86)
--
-- Host: localhost    Database: mydb
-- ------------------------------------------------------
-- Server version	5.6.14

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `holidays`
--

DROP TABLE IF EXISTS `holidays`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `holidays` (
  `index` int(11) NOT NULL,
  `name` text NOT NULL,
  `date` int(11) NOT NULL,
  `month` int(11) NOT NULL,
  `info` longtext NOT NULL,
  `changing` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`index`),
  UNIQUE KEY `index_UNIQUE` (`index`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `holidays`
--

LOCK TABLES `holidays` WRITE;
/*!40000 ALTER TABLE `holidays` DISABLE KEYS */;
INSERT INTO `holidays` VALUES (0,'Православний святвечір',6,1,'6 січня у всьому світі відзначається православний святвечір — саме напередодні Різдва Христового. Це свято здавна було шанованим на Русі. Коляди, як ще називають цей вечір, завершають Різдвяний пост.',0),(1,'Православне Різдво Христове',7,1,'7 січня відзначають православне Різдво Христове — одне з найбільших свят церковного світу. Воно прославляє день, який ознаменувався небувалою подією для всіх - народженням Сина Божого у Богородиці Діви Марії.',0),(2,'Обрізання Господнє',14,1,'14 січня православні християни відзначають історичну для себе подію — Обрізання Господнє, яке проводили на восьмий день після народження Ісуса Христа. Про цю подію нам повідало Євангеліє від Луки.',0),(3,'Голодна кутя',18,1,'18 січня у православному світі відзначається Голодна кутя, яка за своєю суттю є вечером-приготуванням до великого свята Богоявлення Господнього Хрещення. Це пам\'ятний день для християн, оскільки саме тоді відбулося хрещення Ісуса Христа. Як відомо, його в річці Йордан хрестив Іоанн Предтеча.',0),(4,'Хрещення Господнє',19,1,'19 січня православна церква відзначає Хрещення Господнє. Це свято ще називають Богоявленням. Хрещення — найдавніше свято християн, яке відзначали ще апостоли Ісуса Христа. У давнину свято називали Єпіфанією або ж Свєти. У чотирьох Євангеліях сказано, що в день Хрещення Господнього Бог приходить, щоб показати людям Світло Неприступне.',0),(5,'Православне Стрітення Господнє',15,2,'15 лютого християни відзначають Православне Стрітення Господнє. В цей день втілене Слово Боже з\'явилося на землю, і це чудове явище побачило кілька людей. Одним з них виявився старець Симеон. Йому було обіцяне життя до того часу, поки він не побачить на власні очі Христа Господнього. Саме Симеон передрік народження Сина Господнього Марією. Однак старець хотів знищити своє пророцтво, оскільки не міг зрозуміти, як непорочна дівиця народить дитину. Тоді до нього з\'явився Ангел і сказав, що треба вірити, і тоді Симеон побачить Сина Божого. Коли Спасителя принесли в храм після сорока днів життя, Симеон побачив Дитятко, і після цього Господь забрав його до себе.',0),(6,'Благовіщення Пресвятої Богородиці',7,4,'7 квітня за григоріанським календарем відзначається Благовіщення Пресвятої Богородиці — день, який знаменує зачаття Христа і Початок спокутування. Ймовірно, це свято відзначалося з давніх-давен. Але до нашого часу дійшли відомості про те, що в 560 році волею імператора Юстиніан датою для святкування Благовіщення було вибрано 25 березня (за старим стилем).',0),(7,'Великий (Чистий) четвер',2,5,'2 травня в 2013 році православні християни відзначають Великий (Чистий) четвер. Цей день є нагадуванням людству про Таємну вечерю, на якій Ісус закликав усіх своїх учнів до прояву братської любові і смиренності по відношенню один до одного. На знак цього він омив апостолам ноги і провів обряд Святого Причастя.',0),(8,'День святого Георгія Побідоносця',6,5,'День святого Георгія Побідоносця святкують 6 травня. Це свято в честь великомученика, який виріс в багатій християнській родині і зміг присвятити своє життя благим справам.',0),(9,'День Святого Духа',24,6,'Щороку День Святого Духа віруючі люди святкують наступного понеділка після П\'ятидесятниці (Святої Трійці). Церква відзначає цей день, таким чином звеличуючи Животворящий Дух.',0),(10,'Свято славних і всехвальних первоверховних апостолів Петра і Павла',12,7,'12 липня православні люди всього світу відзначають Свято славних і всехвальних первоверховних апостолів Петра і Павла. Також в цей день традиційно закінчується Петрів піст.',0),(11,'Преображення Господнє',19,8,'19 серпня весь православний світ відзначає свято Преображення Господнє. Поява цього церковного свята пов\'язана з появою Господа перед своїми учнями. Свідками Преображення Господнього стали Петро, Яків, Іван, які побачили над горою Фавор обличчя Господа та його білий одяг. Тоді з\'явилися пророки Мойсей та Ілля, які говорили з Господом.',0),(12,'Різдво Пресвятої Богородиці',21,9,'21 вересня вважається Різдвом Пресвятої Богородиці. Це свято церква стала відзначати в IV столітті. Різдво Пресвятої Богородиці — двунадесяте свято церковного календаря, початок якого припадає на 1 вересня за старим стилем. З цим святом пов\'язаний один переказ.',0),(13,'Покрова Пресвятої Богородиці',14,10,'Християнське та народне свято Покрова Пресвятої Богородиці відзначається церквами східного обряду 14 жовтня (1 жовтня за старим стилем). Крім того в цей день в Україні відзначають День українського козацтва та День української повстанської армії (День УПА).',0),(14,'День святого Миколая',19,12,'19 грудня парафіяни православної церкви відзначають День святого Миколая — покровителя всіх мандрівників і дітей. Свято вважається одним із найбільш шанованих у православному світі.',0),(15,'День пам\'яті пророка Аггея',29,12,'29 грудня відзначається День пам\'яті пророка Аггея — десятого із дванадцяти малих пророків, який пророкував при царі Персії Дарії Гістаспі ще за 500 років до Різдва Христового.',0),(16,'Православна Пасха',0,0,'Православна Пасха в 2013 році припадає на 5 травня. Воскресіння Христового вважається найбільшим святом в християнському світі. У цей день відбувся перехід Сина Божого від смерті до життя. Ісус воскрес, і на Православну Пасху прийнято вітати людей словами «Христос воскрес!», На що співрозмовник повинен відповідати «Воістину воскрес!».',-1),(17,'Масниця',0,0,'Масниця — одне з найулюбленіших свят слов\'янських народів. У 2013 році масний тиждень припадає на 11-17 березня. Це затяжне свято є підготовчим тижнем до Великого посту. Воно необхідне для примирення з ближніми і підготовки до покаяння перед Богом.',-2),(18,'Прощена неділя',0,0,'17 березня в 2013 році відзначається Прощена неділя. Традиційно в цей день прийнято просити прощення у Господа і всіх людей, які оточують людину. З Прощеною неділею пов\'язаний ще один церковний звичай — читати на літургії Нагірну Проповідь Євангелія, де сказано, що людина повинна прощати образи ближніх і намагатися примиритися з ворогуючими.',-3),(19,'Вхід Господній в Єрусалим (Вербна неділя)',0,0,'У 2013 році Вхід Господній в Єрусалим (Вербна неділя) припадає на 28 квітня. Це свято ознаменував вступ Ісуса на шлях хрещених страждань, який було розпочато після Його входу в Єрусалим. Ця подія описана чотирма євангелістами.',-4),(20,'Вознесіння Господнє',0,0,'13 червня в 2013 році православний церковний світ відзначає Вознесіння Господнє. Вознесіння Ісуса Христа в Небо завершило земне служіння Сина Божого. Сталося це на сороковий день після Воскресіння Ісуса. Саме свято Вознесіння припадає на четвер шостого тижня після Великодня.',-5),(21,'День Святої Трійці (П\'ятидесятниця)',0,0,'День святої Трійці, який в народі називають просто Трійця, в 2013 році припадає на 23 червня. Оскільки свято відзначають на п\'ятдесятий день після Великодня, він має ще одну назву — П\'ятидесятниця.',-6);
/*!40000 ALTER TABLE `holidays` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2013-11-17 18:36:00
